{
  "schemes": [
    {
      "id": "pm-kisan",
      "name": "PM-Kisan Samman Nidhi",
      "category": "farmer",
      "description": "Central scheme that gives Rs 6,000 per year in three equal instalments to small and marginal farmer families.",
      "eligibility": "You must be a small or marginal farmer. Landholding should be in your name. You should be an Indian citizen.",
      "benefits": "Rs 2,000 every 4 months (Rs 6,000 per year) directly in your bank account.",
      "requiredDocuments": ["Aadhaar card", "Bank account details", "Land ownership papers", "Farmer passport size photo"],
      "howToApply": [
        "Visit the PM-Kisan portal or go to your nearest Common Service Centre (CSC).",
        "Fill the PM-Kisan form with your name, mobile, Aadhaar, bank account and land details.",
        "Submit the form with copies of Aadhaar and land papers.",
        "Your application will be verified. Once approved, money will be sent to your bank account."
      ],
      "officialLink": "https://pmkisan.gov.in",
      "criteria": {
        "occupations": ["Farmer"],
        "minAge": 18,
        "maxAge": null,
        "maxAnnualIncome": null,
        "states": []
      }
    },
    {
      "id": "atal-pension",
      "name": "Atal Pension Yojana",
      "category": "pension",
      "description": "A pension scheme for workers in the unorganised sector. You get a fixed pension every month after 60 years of age.",
      "eligibility": "You must be between 18 and 40 years. You must have a bank account. You should be an Indian citizen. Mainly for workers without any organised pension.",
      "benefits": "Monthly pension of Rs 1,000 to Rs 5,000 after 60 years, depending on your contribution. Government also adds 50% of your contribution for 5 years (up to Rs 1,000 per year).",
      "requiredDocuments": ["Aadhaar card", "Bank account linked with Aadhaar", "Mobile number"],
      "howToApply": [
        "Open an account with any bank that offers Atal Pension Yojana.",
        "Fill the APY form. Choose your monthly pension amount (Rs 1,000 to Rs 5,000).",
        "Give your Aadhaar and bank details. Consent for auto-debit of monthly contribution.",
        "Pay the monthly contribution on time. Pension will start after you turn 60."
      ],
      "officialLink": "https://www.psbindia.in/atal-pension-yojana.aspx",
      "criteria": {
        "occupations": ["Unemployed", "Senior Citizen", "Farmer", "Student"],
        "minAge": 18,
        "maxAge": 40,
        "maxAnnualIncome": null,
        "states": []
      }
    },
    {
      "id": "ayushman-bharat",
      "name": "Ayushman Bharat Pradhan Mantri Jan Arogya Yojana",
      "category": "health",
      "description": "Health insurance that gives up to Rs 5 lakh per family per year for hospitalisation. No need to pay at the time of treatment.",
      "eligibility": "Your family should be in the listed deprived categories (e.g. rural landless, manual workers). Your name should be in the SECC 2011 data. No age limit.",
      "benefits": "Cashless treatment up to Rs 5 lakh per family per year in empanelled hospitals. Covers most illnesses and surgeries.",
      "requiredDocuments": ["Aadhaar card", "Ration card or SECC document", "Family identity proof"],
      "howToApply": [
        "Check if your family is eligible on the Ayushman Bharat website or at a Common Service Centre.",
        "If eligible, get your Ayushman card from the nearest hospital or CSC.",
        "Show your Ayushman card and Aadhaar at any empanelled hospital for cashless treatment.",
        "You can also call the helpline 14555 for help."
      ],
      "officialLink": "https://pmjay.gov.in",
      "criteria": {
        "occupations": [],
        "minAge": null,
        "maxAge": null,
        "maxAnnualIncome": 250000,
        "states": []
      }
    },
    {
      "id": "vidya-lakshmi",
      "name": "PM Vidya Lakshmi",
      "category": "education",
      "description": "Single online portal to apply for education loans from many banks. Students can compare and apply for loans easily.",
      "eligibility": "You must be an Indian citizen. You should be admitted to a recognised course (higher education, professional, vocational). Your course and institute should be approved by the bank.",
      "benefits": "One place to apply to multiple banks, track application status, and get education loan without collateral up to Rs 7.5 lakh.",
      "requiredDocuments": ["Photo ID (Aadhaar/Passport)", "Proof of admission", "Mark sheets of last exam", "Income proof of parent/guardian", "Passport size photos"],
      "howToApply": [
        "Register on the Vidya Lakshmi portal (vidyalakshmi.co.in).",
        "Fill your course and personal details. Choose the loan amount you need.",
        "Select banks and submit the application. Upload required documents.",
        "Banks will contact you. Complete their process and get the loan."
      ],
      "officialLink": "https://www.vidyalakshmi.co.in",
      "criteria": {
        "occupations": ["Student"],
        "minAge": 16,
        "maxAge": 35,
        "maxAnnualIncome": null,
        "states": []
      }
    },
    {
      "id": "national-pension",
      "name": "National Pension System (NPS)",
      "category": "pension",
      "description": "A voluntary pension scheme. You save regularly and get a pension after 60. Open to all Indian citizens.",
      "eligibility": "Any Indian citizen between 18 and 70 years can join. You need a bank account and PAN.",
      "benefits": "Tax benefits on contribution. After 60, you get a part as lump sum and rest as monthly pension. You can choose how much to invest.",
      "requiredDocuments": ["Aadhaar card", "PAN card", "Bank account details", "Passport size photo"],
      "howToApply": [
        "Visit the NPS website or go to any bank or post office that offers NPS.",
        "Fill the subscriber registration form. Choose Tier I (pension) or Tier II (savings).",
        "Submit Aadhaar, PAN and bank details. Pay the minimum amount (Rs 500 for opening).",
        "You will get a PRAN (Permanent Retirement Account Number). Contribute regularly online or at the bank."
      ],
      "officialLink": "https://www.npscra.nsdl.co.in",
      "criteria": {
        "occupations": ["Student", "Farmer", "Unemployed", "Senior Citizen"],
        "minAge": 18,
        "maxAge": 70,
        "maxAnnualIncome": null,
        "states": []
      }
    },
    {
      "id": "ujjwala",
      "name": "Pradhan Mantri Ujjwala Yojana",
      "category": "women",
      "description": "Free LPG connection to women from poor families so they can cook with clean fuel instead of wood or coal.",
      "eligibility": "Adult woman from a household that does not have an LPG connection. Family should be in the eligible list (e.g. SC/ST, PMAY, Antyodaya, forest dwellers, most backward classes).",
      "benefits": "One free LPG connection (cylinder and regulator). You pay only for the first refill. No deposit for the connection.",
      "requiredDocuments": ["Aadhaar of the woman", "Proof of address", "BPL certificate or eligible category proof", "Passport size photo", "Bank account details"],
      "howToApply": [
        "Go to your nearest LPG distributor (HP, BPCL, IOCL) with your documents.",
        "Fill the Ujjwala application form. Give Aadhaar, address and BPL/eligibility proof.",
        "Submit the form and documents. You will get a receipt.",
        "After verification, you will get a free LPG connection. Book your first cylinder and pay only for the refill."
      ],
      "officialLink": "https://pmuy.gov.in",
      "criteria": {
        "occupations": [],
        "minAge": 18,
        "maxAge": null,
        "maxAnnualIncome": 150000,
        "states": []
      }
    },
    {
      "id": "mid-day-meal",
      "name": "Mid-Day Meal Scheme",
      "category": "education",
      "description": "Free cooked midday meal for children studying in government and government-aided schools. Improves nutrition and attendance.",
      "eligibility": "Your child must be enrolled in a government or government-aided primary/upper primary school (Classes 1 to 8).",
      "benefits": "One free nutritious meal every school day. Calories and protein as per guidelines. No cost to the family.",
      "requiredDocuments": ["School enrolment proof", "Aadhaar of child (if available)", "Ration card or identity of parent"],
      "howToApply": [
        "Admit your child in a government or government-aided school (Class 1 to 8).",
        "The school automatically includes eligible children in the mid-day meal list.",
        "No separate form in most states. Child gets the meal on school days.",
        "For any issue, contact the school principal or the district education office."
      ],
      "officialLink": "https://mdm.nic.in",
      "criteria": {
        "occupations": ["Student", "Farmer", "Unemployed"],
        "minAge": 5,
        "maxAge": 14,
        "maxAnnualIncome": null,
        "states": []
      }
    },
    {
      "id": "matru-vandana",
      "name": "Pradhan Mantri Matru Vandana Yojana",
      "category": "women",
      "description": "Cash benefit for pregnant women and new mothers. Rs 5,000 in instalments for first living child to support nutrition and rest.",
      "eligibility": "Pregnant woman or mother of first living child. You should be 19 years or older. Not eligible if you are a government employee or get similar benefits.",
      "benefits": "Rs 2,000 in first instalment (after registration), Rs 2,000 after first vaccination, Rs 1,000 after second vaccination (total Rs 5,000).",
      "requiredDocuments": ["Aadhaar card", "Husband's Aadhaar", "Mother-Child Protection card", "Bank account details", "Passport size photo"],
      "howToApply": [
        "Register at the nearest Anganwadi centre or health centre when you are pregnant.",
        "Fill the PMMVY form. Give Aadhaar, bank account and pregnancy details.",
        "Submit the form with copies of Aadhaar and bank passbook.",
        "After verification, you will get the first instalment. Get your child vaccinated on time to receive the next instalments."
      ],
      "officialLink": "https://wcd.nic.in/schemes/pradhan-mantri-matru-vandana-yojana",
      "criteria": {
        "occupations": [],
        "minAge": 19,
        "maxAge": null,
        "maxAnnualIncome": null,
        "states": []
      }
    }
  ]
}
